Autodesk.Revit.DB.ScheduleFieldId.InvalidScheduleFieldId
Get the invalid ScheduleFieldId whose IntegerValue is -1.

Autodesk.Revit.DB.ScheduleFieldId.op_Inequality(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFieldId)
Determines whether two ScheduleFieldId are different.
first: The first ScheduleFieldId.
second: The second ScheduleFieldId.
Returns: True if the ScheduleFieldId are different, otherwise false.

Autodesk.Revit.DB.ScheduleFieldId.op_Equality(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFieldId)
Determines whether two ScheduleFieldIds are the same.
first: The first ScheduleFieldId.
second: The second ScheduleFieldId.
Returns: True if the ScheduleFieldIds are the same, otherwise false.

Autodesk.Revit.DB.ScheduleFieldId.ToString
Gets a String representation of the integer value of the id.

Autodesk.Revit.DB.ScheduleFieldId.GetHashCode
Gets the integer value of the id as hash code

Autodesk.Revit.DB.ScheduleFieldId.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  The other object to evaluate.

Autodesk.Revit.DB.ScheduleFieldId.IntegerValue
Provides the value of the ScheduleFieldId as an integer.
Since:
2013

Autodesk.Revit.DB.ScheduleFieldId.#ctor(System.Int32)
Since:
2013

Autodesk.Revit.DB.ScheduleFieldId
The ScheduleFieldId object is used as a unique identification for a field in a schedule.